tutorials/RAS/3DScour/system/blockMeshDict
FoamFile
{
    version	 2.0;
    format	 ascii;
    class	 dictionary;
    object	 blockMeshDict;
}

/*
Automatically generated with generateMeshDict_cyl_3dsedim.pl 0.4 -0.025 0.0 0.2 -0.1 0.4 1.2 0.8
*/

convertToMeters	 1.0;

vertices
(
    ( -0.4  0.4 0.0 ) //0
    ( -0.2   0.4 0.0 ) //1
    (  0.2   0.4 0.0 ) //2
    (  0.8  0.4 0.0 ) //3
    ( -0.4  0.2 0.0 ) //4
    ( -0.2   0.2 0.0 ) //5
    (  0.2   0.2 0.0 ) //6
    (  0.8  0.2 0.0 ) //7
    ( -0.4  -0.2 0.0 ) //8
    ( -0.2   -0.2 0.0 ) //9
    (  0.2   -0.2 0.0 ) //10
    (  0.8  -0.2 0.0 ) //11
    ( -0.4  -0.4 0.0 ) //12
    ( -0.2   -0.4 0.0 ) //13
    (  0.2   -0.4 0.0 ) //14
    (  0.8  -0.4 0.0 ) //15
    ( -0.4  0.4 0.2 ) //16
    ( -0.2   0.4 0.2 ) //17
    (  0.2   0.4 0.2 ) //18
    (  0.8  0.4 0.2 ) //19
    ( -0.4  0.2 0.2 ) //20
    ( -0.2   0.2 0.2 ) //21
    (  0.2   0.2 0.2 ) //22
    (  0.8  0.2 0.2 ) //23
    ( -0.4  -0.2 0.2 ) //24
    ( -0.2   -0.2 0.2 ) //25
    (  0.2   -0.2 0.2 ) //26
    (  0.8  -0.2 0.2 ) //27
    ( -0.4  -0.4 0.2 ) //28
    ( -0.2   -0.4 0.2 ) //29
    (  0.2   -0.4 0.2 ) //30
    (  0.8  -0.4 0.2 ) //31
    ( -0.0353553390593274   0.0353553390593274 0.0 ) //32
    (  0.0353553390593274   0.0353553390593274 0.0 ) //33
    ( -0.0353553390593274   -0.0353553390593274 0.0 ) //34
    (  0.0353553390593274   -0.0353553390593274 0.0 ) //35
    ( -0.0353553390593274   0.0353553390593274 0.2 ) //36
    (  0.0353553390593274   0.0353553390593274 0.2 ) //37
    ( -0.0353553390593274   -0.0353553390593274 0.2 ) //38
    (  0.0353553390593274   -0.0353553390593274 0.2 ) //39
    ( -0.4  0.4 -0.025 ) //40
    ( -0.2   0.4 -0.025 ) //41
    (  0.2   0.4 -0.025 ) //42
    (  0.8  0.4 -0.025 ) //43
    ( -0.4  0.2 -0.025 ) //44
    ( -0.2   0.2 -0.025 ) //45
    (  0.2   0.2 -0.025 ) //46
    (  0.8  0.2 -0.025 ) //47
    ( -0.4  -0.2 -0.025 ) //48
    ( -0.2   -0.2 -0.025 ) //49
    (  0.2   -0.2 -0.025 ) //45
    (  0.8  -0.2 -0.025 ) //51
    ( -0.4  -0.4 -0.025 ) //52
    ( -0.2   -0.4 -0.025 ) //53
    (  0.2   -0.4 -0.025 ) //54
    (  0.8  -0.4 -0.025 ) //55
    ( -0.0353553390593274   0.0353553390593274 -0.025 ) //56
    (  0.0353553390593274   0.0353553390593274 -0.025 ) //57
    ( -0.0353553390593274   -0.0353553390593274 -0.025 ) //58
    (  0.0353553390593274   -0.0353553390593274 -0.025 ) //59
    ( -0.2   0.2 -0.1 ) //60
    (  0.2   0.2 -0.1 ) //61
    ( -0.2   -0.2 -0.1 ) //62
    (  0.2   -0.2 -0.1 ) //63
    ( -0.0353553390593274   0.0353553390593274 -0.1 ) //64
    (  0.0353553390593274   0.0353553390593274 -0.1 ) //65
    ( -0.0353553390593274   -0.0353553390593274 -0.1 ) //66
    (  0.0353553390593274   -0.0353553390593274 -0.1 ) //67
);

blocks
(
    hex (4 5 1 0 20 21 17 16) (22 11 64) simpleGrading (0.945980604759054 1.00394312014 100) //0
    hex (5 6 2 1 21 22 18 17) (64 11 64) simpleGrading (1 1.00394312014 100) //1
    hex (6 7 3 2 22 23 19 18) (44 11 64) simpleGrading (1.05710412557 1.00394312014 100) //2
    hex (8 9 5 4 24 25 21 20) (22 64 64) simpleGrading (0.945980604759054 1 100) //3
    hex (10 11 7 6 26 27 23 22) (44 64 64) simpleGrading (1.05710412557 1 100)//4
    hex (12 13 9 8 28 29 25 24) (22 11 64) simpleGrading (0.945980604759054 0.996072366988829 100)//5
    hex (13 14 10 9 29 30 26 25) (64 11 64) simpleGrading (1 0.996072366988829 100)//6
    hex (14 15 11 10 30 31 27 26) (44 11 64) simpleGrading (1.05710412557 0.996072366988829 100)//7
    hex (32 33 6 5 36 37 22 21) (64 64 64) simpleGrading (1 10 100)//8
    hex (35 10 6 33 39 26 22 37) (64 64 64) simpleGrading (10 1 100)//9
    hex (9 10 35 34 25 26 39 38) (64 64 64) simpleGrading (1 0.1 100)//10
    hex (9 34 32 5 25 38 36 21) (64 64 64) simpleGrading (0.1 1 100)//11
    hex (44 45 41 40 4 5 1 0) (22 11 100) simpleGrading (0.945980604759054 1.00394312014 0.395760221530928) //12
    hex (45 46 42 41 5 6 2 1) (64 11 100) simpleGrading (1 1.00394312014 0.395760221530928) //13
    hex (46 47 43 42 6 7 3 2) (44 11 100) simpleGrading (1.05710412557 1.00394312014 0.395760221530928) //14
    hex (48 49 45 44 8 9 5 4) (22 64 100) simpleGrading (0.945980604759054 1 0.395760221530928) //15
    hex (50 51 47 46 10 11 7 6) (44 64 100) simpleGrading (1.05710412557 1 0.395760221530928)//16
    hex (52 53 49 48 12 13 9 8) (22 11 100) simpleGrading (0.945980604759054 0.996072366988829 0.395760221530928)//17
    hex (53 54 50 49 13 14 10 9) (64 11 100) simpleGrading (1 0.996072366988829 0.395760221530928)//18
    hex (54 55 51 50 14 15 11 10) (44 11 100) simpleGrading (1.05710412557 0.996072366988829 0.395760221530928)//19
    hex (56 57 46 45 32 33 6 5) (64 64 100) simpleGrading (1 10 0.395760221530928)//20
    hex (59 50 46 57 35 10 6 33) (64 64 100) simpleGrading (10 1 0.395760221530928)//21
    hex (49 50 59 58 9 10 35 34) (64 64 100) simpleGrading (1 0.1 0.395760221530928)//22
    hex (49 58 56 45 9 34 32 5) (64 64 100) simpleGrading (0.1 1 0.395760221530928)//23
    hex (64 65 61 60 56 57 46 45) (64 64 100) simpleGrading (1 10 0.298440659706976)//24
    hex (67 63 61 65 59 50 46 57) (64 64 100) simpleGrading (10 1 0.298440659706976)//25
    hex (62 63 67 66 49 50 59 58) (64 64 100) simpleGrading (1 0.1 0.298440659706976)//26
    hex (62 66 64 60 49 58 56 45) (64 64 100) simpleGrading (0.1 1 0.298440659706976)//27
);

edges
(
    arc 32 33 ( 0 0.05 0.0 )
    arc 33 35 ( 0.05 0 0.0 )
    arc 34 35 ( 0 -0.05 0.0 )
    arc 34 32 ( -0.05 0 0.0 )
    arc 36 37 ( 0 0.05 0.2 )
    arc 39 37 ( 0.05 0 0.2 )
    arc 38 39 ( 0 -0.05 0.2 )
    arc 38 36 ( -0.05 0 0.2 )
    arc 56 57 ( 0 0.05 -0.025 )
    arc 59 57 ( 0.05 0 -0.025 )
    arc 58 59 ( 0 -0.05 -0.025 )
    arc 58 56 ( -0.05 0 -0.025 )
    arc 64 65 ( 0 0.05 -0.1 )
    arc 67 65 ( 0.05 0 -0.1 )
    arc 66 67 ( 0 -0.05 -0.1 )
    arc 66 64 ( -0.05 0 -0.1 )
    arc 5 6 ( 0 0.282842712474619 0.0 )
    arc 6 10 ( 0.282842712474619 0 0.0 )
    arc 9 10 ( 0 -0.282842712474619 0.0 )
    arc 9 5 ( -0.282842712474619 0 0.0 )
    arc 21 22 ( 0 0.282842712474619 0.2 )
    arc 26 22 ( 0.282842712474619 0 0.2 )
    arc 25 26 ( 0 -0.282842712474619 0.2 )
    arc 25 21 ( -0.282842712474619 0 0.2 )
    arc 45 46 ( 0 0.282842712474619 -0.025 )
    arc 46 50 ( 0.282842712474619 0 -0.025 )
    arc 49 50 ( 0 -0.282842712474619 -0.025 )
    arc 49 45 ( -0.282842712474619 0 -0.025 )
    arc 60 61 ( 0 0.282842712474619 -0.1 )
    arc 63 61 ( 0.282842712474619 0 -0.1 )
    arc 62 63 ( 0 -0.282842712474619 -0.1 )
    arc 62 60 ( -0.282842712474619 0 -0.1 )
);

boundary
(
    cylinder
    {
        type wall;
        faces
        (
            (32 36 37 33)
            (33 37 39 35)
            (35 39 38 34)
            (34 38 36 32)
            (56 32 33 57)
            (57 33 35 59)
            (59 35 34 58)
            (58 34 32 56)
            (64 56 57 65)
            (65 57 59 67)
            (67 59 58 66)
            (66 58 56 64)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (4 20 16 0)
            (8 24 20 4)
            (12 28 24 8)
            (44 4 0 40)
            (48 8 4 44)
            (52 12 8 48)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 19 23 7)
            (7 23 27 11)
            (11 27 31 15)
        );
    }

    outletb
    {
        type wall;
        faces
        (
            (43 3 7 47)
            (47 7 11 51)
            (51 11 15 55)
        );
    }

    pit
    {
        type wall;
        faces
        (
            (45 46 61 60)
            (62 63 50 49)
            (61 46 50 63)
            (62 49 45 60)
        );
    }

    lateral
    {
        type cyclic;
        neighbourPatch symplane; 
        faces
        (
            (16 17 1 0)
            (17 18 2 1)
            (18 19 3 2)
            (0 1 41 40)
            (1 2 42 41)
            (2 3 43 42)
        );
    }

    symplane
    {
        type cyclic;
        neighbourPatch lateral; 
        faces
        (
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
            (52 53 13 12)
            (53 54 14 13)
            (54 55 15 14)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (40 41 45 44)
            (41 42 46 45)
            (42 43 47 46)
            (44 45 49 48)
            (46 47 51 50)
            (48 49 53 52)
            (49 50 54 53)
            (50 51 55 54)
            (60 61 65 64)
            (61 63 67 65)
            (66 67 63 62)
            (60 64 66 62)
         );
    }

    surface
    {
        type patch;
        faces
        (
            (20 21 17 16)
            (21 22 18 17)
            (22 23 19 18)
            (24 25 21 20)
            (26 27 23 22)
            (28 29 25 24)
            (29 30 26 25)
            (30 31 27 26)
            (36 37 22 21)
            (39 26 22 37)
            (25 26 39 38)
            (25 38 36 21)
        );
    }

);

mergPatchPairs
(
);
